import img1 from "./asset/พี่ๆตัดแว่นให้หน่อย.jpg";
import img2 from "./asset/ไม่อยากฟัง.jpg";
import img3 from "./asset/1001 (You’re Lovely).jpg";
import img4 from "./asset/จะกลับไปดีกับเขาก็บอก.jpg";
import img5 from "./asset/มีปัญหาปรึกษาดาว.jpg";
import img6 from "./asset/ไม่พิเศษ.jpg";
import img7 from "./asset/กำลังตัดใจ.jpg";
import img8 from "./asset/ลืมเขาได้ยัง.jpg";
import img9 from "./asset/บอกให้ฟังหน่อยนะ (please tell me).jpg";
import img10 from "./asset/หากว่าฉัน.jpg";
import img11 from "./asset/ยิ่งเหงายิ่งคิดถึงเธอ.jpg";
import img12 from "./asset/เพื่อนดีเด่น (BEST FRIEND 4EVER).jpg";
import img13 from "./asset/รักเขาแทนฉันที (Promise Me).jpg";
import img14 from "./asset/แป๊ปนึง (Can You Stay).jpg";
import img15 from "./asset/แฟนฉัน (Love Ads).jpg";
import img16 from "./asset/I (don't) MISS YOU (Japanese Version).jpg";
import img17 from "./asset/โกหกเธอทั้งนั้น (Pinocchio).jpg";
import img18 from "./asset/อย่าไปรักเขาเลยเธอ (Someone Who Cares).jpg";
import img19 from "./asset/เธอ ๆ เพื่อนเราชอบ (Guess Who).jpg";
import { Link } from "react-router-dom";

export default function Music() {
  const musicList = [
    {
      title: "พี่ๆ ตัดแว่นให้หน่อย",
      description: `รู้สึกว่าการอยู่ในความสัมพันธ์ที่คลุมเครือ มันเหมือนกับคนสายตาสั้น เวลามองอะไรก็ไม่ค่อยชัดเจน ว่าสิ่งที่เธอทำมันหมายความว่าอะไรกันแน่ หรือสงสัยต้องลองไปตัดแว่นแล้วมั้ง เผื่อจะช่วยอะไรได้บ้าง
" เพราะไม่รู้ว่าที่เธอทำอยู่มันไม่ชัดเจน หรือว่าฉันมองไม่ชัดเอง "

“พี่ๆ ตัดแว่นให้หน่อย” ซิงเกิลแรกจาก SERIOUS BACON น้องใหม่ค่าย BOXX MUSIC เปิดตัวด้วยแนวเพลงสนุก สดใส น่ารัก กวนๆ ที่จะทำให้ทุกคนมีรอยยิ้ม 

โดยเค้กกับเมืองเจอกันครั้งแรก เพราะทำฝ่ายเพลงด้วยกันที่คณะนิเทศ จุฬาฯ เลยได้ลองไปเล่นดนตรีที่งานๆ นึง แล้วรู้สึกสนุกดี ในความลงตัวแปลกๆ ทั้งคู่เลยชวนกันมาทำวง และตั้งชื่อกันสนุกๆ ว่า SERIOUS BACON เริ่มจากทำ cover เล่นๆ ลง youtube และได้กระแสตอบรับดีมาก จนได้มาเริ่มต้นชีวิตการเป็นศิลปินเต็มตัวกับค่าย BOXX MUSIC`,
      image: img1,
      linkYoutube: "https://www.youtube.com/watch?v=KWhIaytWsms",
      releaseDate: "23/7/2020",
    },
    {
      title: "ไม่อยากฟัง",
      description: `ถ้าตอนนี้เธอรู้สึกไม่เหมือนเดิมแล้ว ก็แค่บอกกันตรงๆว่าไม่รู้สึก ไม่เห็นต้องหาเหตุผลอะไรมาอธิบายให้รู้สึกแย่กว่าเดิมเลย “เพราะว่าฉันไม่ได้อยากฟัง”

"เพลงไม่อยากฟัง ซิงเกิลที่สอง จากพวกเรา ซีเรียสเบคอน เป็นเพลงที่เล่าถึงความสัมพันธ์ของคนสองคน ก่อนหน้านี้รักกันอยู่ดีๆ แต่แล้ววันนึงกลับบอกว่า เราเข้ากันไม่ได้เลย คุยกันไม่เข้าใจเลย บอกว่าเราดีเกินไป ทั้งๆ ที่จริงๆ แล้ว เขาก็แค่ไม่รักเราแล้วแค่นั้นเอง เพลงนี้แต่งให้ทุกคนที่ไม่อยากฟังข้ออ้างเหล่านี้แล้ว หวังว่าจะชอบกันนะ"`,
      image: img2,
      linkYoutube: "https://www.youtube.com/watch?v=dytvU-Z-H1k",
      releaseDate: "22/10/2020",
    },
    {
      title: "1001 (You’re Lovely)",
      description: `พวกเราได้มีโอกาสร่วมงานกับทาง 10vely แฟนๆของคุณเตนล์ เพื่อทำเพลงนี้ขึ้นมา เป็นโปรเจคที่พวกเราสนุกมากๆฮะ
หวังว่าเพลงนี้จะเป็นตัวแทนที่สามารถมอบความรักและรอยยิ้มให้กับทุกคนที่ฟังได้นะ :-)
ป.ล. สุขสันต์วันเกิดคุณเตนล์ด้วยนะฮะ 🎂❤️


"ความรัก" ไม่ว่าจะเกิดขึ้นในรูปแบบไหนก็เป็นสิ่งที่สวยงามเสมอ

และความรักครั้งนี้ไม่ต้องการสิ่งใดตอบแทนนอกจาก "รอยยิ้ม" และ "ความสุข" ของเธอ

ขอให้เพลงนี้เป็นสิ่งแทนใจเพื่อเป็นของขวัญให้กับคนที่พวกเรารักและเฝ้าห่วงใยตลอดมา

สุขสันต์วันเกิดคนน่ารัก... ขอให้มีความสุขมากๆ นะ "เตนล์”`,
      image: img3,
      linkYoutube: "https://www.youtube.com/watch?v=iO8ouMrxFM8",
      releaseDate: "22/10/2020",
    },
    {
      title: "จะกลับไปดีกับเขาก็บอก",
      description: `อยู่ข้างเธอได้แค่ชั่วคราวเมื่อเธอเศร้าใจ เพราะรู้อยู่แล้วว่า “เธอดีกับเขาเมื่อไหร่ ฉันก็ต้องไปอยู่ดี...”

“ เพลงนี้เป็นโทนสีอีกเฉดนึงในหมวดเพลงเศร้าของ SERIOUS BACON เล่าผ่านมุมมองของคนที่รู้ว่า ตัวเองเป็นได้แค่ที่พักใจชั่วคราว พอเธอกลับไปดีกับเขา ก็หมดเวลาของเราแล้ว แต่ก็ยังพร้อมจะอยู่ตรงนี้ ให้เธอแวะมาพักใจตลอดอยู่ดี ถ้าใครกำลังรู้สึกแบบนี้ หวังว่าจะใช้เพลงนี้แทนใจได้ และหวังว่าทุกคนจะชอบเพลงนี้น้า ”`,
      image: img4,
      linkYoutube:
        "https://www.youtube.com/watch?v=sYgVCuv7c1g&pp=ygU_4LiI4Liw4LiB4Lil4Lix4Lia4LmE4Lib4LiU4Li14LiB4Lix4Lia4LmA4LiC4Liy4LiB4LmH4Lia4Lit4LiB",
      releaseDate: "19/7/2021",
    },
    {
      title: "มีปัญหาปรึกษาดาว",
      description: `เพราะคิดถึงเธอจนแทบทนไม่ไหว แต่เธอไม่ได้อยู่ตรงนี้ด้วยกันแล้ว ฉันเลยทำได้แค่ “ฝากให้ดาวไปบอกเธอ”

“มีปัญหาปรึกษาดาว” 1 ในเพลงโปรเจค VIU CLOSE FRIEND โคตรแฟน โดยเพลงนี้ SERIOUS BACON มาพร้อมกับแนวเพลงที่ฟังสบาย แต่เนื้อหายังโดนใจสายเพลงเศร้า

“พวกเรารู้สึกว่า เวลาที่คนเราเหงา เศร้า หรือมีปัญหาอะไร ก็ชอบไปบ่นให้ดาวฟัง ขอให้ดาวช่วยอยู่บ่อยๆ เพลงนี้ก็เลยเล่าจากมุมของคนที่คิดถึงใครคนนึงมากๆ
แต่ทำอะไรไม่ได้เลย นอกจากฝากให้ดาวส่งความคิดถึงนี้ไปให้ถึงเธอ สำหรับคนที่กำลังคิดถึงใครซักคนอยู่ พวกเราหวังว่าเพลงนี้จะช่วยส่งความคิดถึงไปให้ถึงเขาได้นะ”`,
      image: img5,
      linkYoutube:
        "https://www.youtube.com/watch?v=O8sp-JThQCA&pp=ygUw4Lih4Li14Lib4Lix4LiN4Lir4Liy4Lib4Lij4Li24LiB4Lip4Liy4LiU4Liy4Lin",
      releaseDate: "20/4/2021",
    },
    {
      title: "ไม่พิเศษ",
      description: `เคยมั้ย เขาเป็นห่วง เขาดูแล เขาใส่ใจ เขาทำเหมือนว่าเราเป็นคนพิเศษ แต่สุดท้าย เขาก็ไม่เคยคิดอะไรกับเราเลย ... ขอเถอะ ถ้าเธอไม่คิดอะไร อย่าทำให้ฉันคิดมากไปเอง

"ไม่พิเศษ" เพลงสำหรับความสัมพันธ์ที่ดูคลุมเครือ เหมือนเขาจะมีใจ สุดท้ายก็มีแต่เราที่คิดไปเอง ตอกย้ำความเศร้าสไตล์ซีเรียสเบคอนที่น่าจะโดนใจใครหลายๆคน เพลงนี้ เค้กจะเป็นคนร้องหลัก เล่าเรื่องผ่านมุมมองของคนที่ไปแอบรักเขา และเร็วๆนี้ จะมีเพลงปล่อยออกมาติดๆกัน ให้ทุกคนได้ติดตาม รอฟัง รอชมว่า เมือง จะมาพร้อมกับบทเพลงอะไร 

"ฝากเพลงจากคนไม่พิเศษที่มอบให้คนพิเศษ เพลงนี้ด้วยนะ ❤️"`,
      image: img6,
      linkYoutube:
        "https://www.youtube.com/watch?v=JBHmgAeaD5w&pp=ygUY4LmE4Lih4LmI4Lie4Li04LmA4Lio4Lip",
      releaseDate: "3/3/2022",
    },
    {
      title: "กำลังตัดใจ",
      description: `ยังคงวนเวียนอยู่ในศาลาคนเศร้า สำหรับเพลงใหม่ของซีเรียสเบคอน หลังจากเพิ่งปล่อยเพลง "ไม่พิเศษ" ในมุมมองที่เค้กเป็นคนถ่ายทอด คราวนี้ เมืองมาพร้อมกับเพลง "กำลังตัดใจ" ที่เล่าถึงคนที่ยังทำใจไม่ได้ ตัดใจไม่ได้จากคนเก่าที่เพิ่งเลิกรากันไป มองอะไรก็ยังนึกถึง ทำอะไรก็ยังนึกถึง สองเพลงนี้ ตั้งใจแต่งขึ้นมาในสองมุมมองความสัมพันธ์ แต่ก็ยังมีอะไรที่เชื่อมโยงกันอยู่ ลองดู MV ของทั้งสองเพลง แล้วจะพบกับความสัมพันธ์รัก 4 เส้า ฝากติดตามเพลงใหม่ของซีเรียสเบคอนทั้งสองเพลงด้วยน้า `,
      image: img7,
      linkYoutube:
        "https://www.youtube.com/watch?v=c2Cca1uihcU&pp=ygUe4LiB4Liz4Lil4Lix4LiH4LiV4Lix4LiU4LmD4LiI",
      releaseDate: "18/4/2022",
    },
    {
      title: "ลืมเขาได้ยัง",
      description: `เพราะเธอยังคิดถึงแต่เขา เรื่องของเราเลยไม่เดินหน้าไปไหน ... เฮ้อ

“เพลงนี้น่าจะเป็นเพลงที่สนุกที่สุดของพวกเราเท่าที่เคยปล่อยเพลงมาแล้ว 55555 
แต่ในความสนุกก็ยังมีความน้อยใจซ่อนอยู่เต็มไปหมด 
ถ้าใครกำลังอยู่ในสถานการณ์แบบนี้ อย่าลืมส่งเพลงนี้ไปถามเขานะ ว่า ลืมเขาได้ยัง?” `,
      image: img8,
      linkYoutube:
        "https://www.youtube.com/watch?v=wnqiSwrtGac&pp=ygUk4Lil4Li34Lih4LmA4LiC4Liy4LmE4LiU4LmJ4Lii4Lix4LiH",
      releaseDate: "17/10/2021",
    },
    {
      title: "บอกให้ฟังหน่อยนะ (please tell me)",
      description: `ไม่กล้าบอกความในใจกับเธอซักที ก็ไม่รู้ว่าถ้าบอกไปแล้วเธอจะคิดยังไง 
“อยากฟังคำนั้นจากเธอก่อนได้ไหม”

“เพลงนี้เป็นเพลงแรกที่พวกเรา SERIOUS BACON และ COPTER ได้มาช่วยกันแต่ง อยากมอบให้กับทุกคนที่อยู่ในความสัมพันธ์ที่เหมือนจะมีอะไรพิเศษ แต่ต่างคนต่างไม่กล้าพูดอะไรออกมาซักที จนมันคลุมเครืออยู่อย่างนั้น ลองส่งเพลงนี้ไปให้เขาฟังก็ได้นะ เผื่อเขาจะยอมบอกให้ฟังซักที ว่าเขาคิดยังไงกับเรา หวังว่าทุกคนจะชอบเพลงนี้น้าาา” - SERIOUS COPTER”`,
      image: img9,
      linkYoutube: "https://www.youtube.com/watch?v=H2hb8vPOpt8",
      releaseDate: "18/3/2021",
    },
    {
      title: "หากว่าฉัน",
      description: `แค่ได้เห็นเธอมีความสุขก็พอใจแล้ว ถึงแม้คนข้าง ๆ เธอจะไม่ใช่เราก็ตาม… มั้ง? 🥺

"หากว่าฉัน" ซิงเกิลสุดท้ายในอัลบั้ม Are You Serious? ของ SERIOUS BACON ที่เพิ่มความพิเศษขึ้นมาด้วยการใช้เครื่องเป่าในเพลง แต่งเติมบรรยากาศดนตรีให้ดูสวยงาม เป็นอีกมุมมองเพลงฟังสบายของ SERIOUS BACON ที่อยากให้ทุกคนได้ฟัง

เพลงนี้ เป็นเพลงสุดท้ายที่แสดงตัวตน ความเป็น SERIOUS BACON ใน chapter แรกของการเข้ามาเป็นศิลปิน ผ่านอัลบั้มเต็มอัลบั้มแรกนี้ หวังว่าแฟนเพลงจะมีความสุขในการฟัง และรอติดตาม chapter หน้าของ SERIOUS BACON ต่อไปนะ ❤️`,
      image: img10,
      linkYoutube: "https://www.youtube.com/watch?v=WBfA4LL9lsA",
      releaseDate: "18/3/2021",
    },
    {
      title: "ยิ่งเหงายิ่งคิดถึงเธอ",
      description: `“HOUSE OF TEARS เป็นโปรเจกต์พิเศษที่เกิดจากความสงสัยของผม ( ปอย PORTRAIT) ว่าถ้าน้องๆ ในค่าย BOXX ถูกระบายสีดำในสไตล์ของ PORTRAIT ลงไป มันจะออกมาเป็นแบบไหน ประกอบกับความต้องการของผมที่อยากทำงานกับน้องๆ ซึ่งเป็นนักดนตรีรุ่นใหม่ที่มีฝีมือมาก อยากแลกเปลี่ยนประสบการณ์ให้กันและกัน จึงเสนอโปรเจกต์เขียนเพลงเศร้าให้ชาว BOXX ได้ร้อง 

ซึ่งความเศร้าของแต่ละศิลปินที่ผมระบายลงไป ก็จะมีเฉดสีแตกต่างกัน บางเพลงเป็นแค่เฉดของความเหงา บางเพลงมืดหม่นไร้ก้นบึ้ง บางเพลงเป็นความฝันลอยๆ เป็นเฉดที่ผมอยากเห็นในตัวตนของน้องๆ แต่ละศิลปิน จึงเกิดมาเป็น 5 เพลงพิเศษที่แต่งร่วมกับน้องๆ ใน BOXX และอีกหนึ่งเพลงใหม่ของผมเอง รวมกันเป็น House of tears” - PORTRAIT

ยิ่งเหงายิ่งคิดถึงเธอ - SERIOUS BACON
"ค่ำคืนแห่งความเหงานั้นช่างยาวนาน ยิ่งเป็นคืนที่คิดถึงใครคนนั้น ถ้าคุณเคยคิดถึงใครจนนอนไม่หลับ เพลงนี้คือเพลงของคุณ”`,
      image: img11,
      linkYoutube: "https://www.youtube.com/watch?v=1AxEGl_KAiw",
      releaseDate: "19/9/2022",
    },
    {
      title: "เพื่อนดีเด่น (BEST FRIEND 4EVER)",
      description: `“ใครได้เธอเป็นแฟนนี่โชคดีมากเลยเนอะ” เธอบอกกันแบบนี้แล้ว เธอไม่อยากเป็นคนโชคดีคนนั้นเองหรอ?

เปิดตัวปี 2023 ด้วยเพลง ‘เพื่อนดีเด่น’ (BEST FRIEND 4EVER) ซึ่งจะเป็นเพลงแรกในอัลบั้มใหม่ที่จะเกิดขึ้นของซีเรียสเบคอน ทุกคนจะได้เห็นการเติบโตของทั้งเค้กและเมืองทั้งด้านตัวตน และสไตล์เพลง ที่จะออกมาในแนวมีสีสันฉูดฉาดขึ้น สนุกขึ้น น่าจะสร้างความตื่นเต้นให้ผู้ฟัง เมื่อได้ยินแนวทางใหม่ในปีนี้ของวง

“เพลงนี้เป็นเพลงแรกที่ได้ปล่อยออกมาในอัลบั้มใหม่ของพวกเราที่กำลังทำอยู่ฮะ ตื่นเต้นและภูมิใจที่จะนำเสนอการเติบโตของพวกเราใน chapter ที่ 2 นี้มาก ๆ พวกเราตั้งใจให้อัลบั้มนี้พาทุกคนมาเจอพวกเราในเฉดสีที่ฉูดฉาดขึ้นกว่าเดิม สนุกขึ้น และหวังว่าจะได้มีเพลงสมหวังกับเค้าสักที 5555 หวังว่าเบคอนจานใหม่นี้ จะเป็นเมนูที่เพื่อน ๆ ชื่นชอบกันน้าา ฝากด้วยฮะ ❤ ” `,
      image: img12,
      linkYoutube: "https://www.youtube.com/watch?v=fMKwJnqtaBA",
      releaseDate: "20/2/2023",
    },
    {
      title: "รักเขาแทนฉันที (Promise Me)",
      description: `ฝากเธอไปรักเขาแทนฉันที ก็ในวันนี้เขาดันเลือกเธอ...

รักเขาแทนฉันที (Promise Me) ซิงเกิลที่สองในอัลบั้มใหม่ของซีเรียสเบคอนในปีนี้ มาด้วยสีสันดนตรีที่เข้มข้นขึ้น แต่ยังคงจุดเด่นเพลงช้าเนื้อหาโดนใจสายรักไม่สมหวัง หลายๆคน คงเคยผ่านเหตุการณ์แอบรักหรือต้องปล่อยคนที่เรารักให้ไปเจอคนที่ดีกว่าสักครั้งหนึ่งในชีวิต ลองให้เพลงนี้เป็นตัวแทนช่วงเวลาเหล่านั้น ผ่านบทเพลงของ SERIOUS BACON

“เค้กเริ่มแต่งเพลงนี้จากการที่ดูซีรี่ส์เรื่องนึง ที่มีพระเอกกับพระรองเป็นเพื่อนสนิทกัน แต่สองคนนี้ดันไปชอบคน ๆ เดียวกัน ด้วยความที่ปกติดูซีรี่ส์แล้วจะชอบแอบเชียร์พระรองอยู่แล้ว พวกเราเลยได้ถ่ายทอดเพลงนี้ออกมาผ่านมุมมองของพระรองในเรื่องนี้ฮะ ไม่บอกหรอกว่าเรื่องอะไร 5555 แต่ถ้าใครกำลังเป็นคนที่ไม่ถูกเลือกแบบในเพลงนี้ หวังว่าเพลงนี้จะเป็นตัวแทนของทุกคนได้นะ 💗” `,
      image: img13,
      linkYoutube: "https://www.youtube.com/watch?v=RxZE2WtR2ck",
      releaseDate: "15/6/2023",
    },
    {
      title: "แป๊ปนึง (Can You Stay?)",
      description: `นาน ๆ ทีกว่าเราจะได้เจอกัน ก็อยากขอให้เธออยู่ข้าง ๆ นานกว่านี้ อีกแป๊บนึง : )

แป๊บนึง (Can you stay?)  ซิงเกิลพิเศษจากการรวมตัวทำเพลงด้วยกันครั้งแรกของ SERIOUS BACON และ Whal & Dolph เป็นการผสมผสานแนวเพลงของทั้งคู่ได้อย่างลงตัว ทั้งเรื่องราว เนื้อเพลง และเสียงร้องที่ไพเราะ ฟังสบาย ละมุน ดีต่อใจ และแนวดนตรีที่จะทำให้แฟนเพลงของทั้งสองวง เพลิดเพลินไปกับเพลงนี้อย่างแน่นอน

“หลังจากที่คนฟังถามหาเพลงรักจากพวกเราอยู่บ่อย ๆ หวังว่าเพลงนี้พอจะเป็นเพลงรักได้นะฮะ 5555 ที่จริงเราติดตามพี่ ๆ Whal & Dolph มาตั้งแต่ก่อนจะทำวงนี้ขึ้นมาอีก ผลงานของพี่ปอพี่น้ำวนเป็นแรงบันดาลใจดี ๆ ให้กับเราเสมอ ดีใจที่ได้มาร่วมงานกับพี่ ๆ ในเพลงนี้ฮะ พวกเรารักเพลงนี้มากเลย หวังว่าคนฟังของเราจะชอบ และได้รับพลังงานดี ๆ จากการฟังเพลงนี้น้า ❤️” - SERIOUS BACON

“น้องเค้ก น้องเมือง โทรมาชวนพวกผมทำเพลงด้วยกัน และส่งเพลง “แป๊บนึง” มาให้ฟัง พวกผมรู้สึกว่าเพลงนี้ เป็นเพลงแอบเศร้าที่ดูน่ารัก และมีความน่าสนใจ จึงอยากทำเพลงนี้ให้สมบูรณ์มากขึ้น ด้วยการใส่มุมมองของตัวละครอีกฝั่ง ลงไปในบทเพลงและใส่เสียงกีตาร์ที่เป็นเอกลักษณ์ของพวกเราเข้าไปด้วย ส่วนตัวแล้วพวกผมสองคนชอบเพลงนี้มาก ๆ ขอฝากเพลง ”แป๊บนึง”  ของพวกเราสองวงด้วยนะครับ ❤️” - Whal & Dolph`,
      image: img14,
      linkYoutube: "https://www.youtube.com/watch?v=muGwHF0Pe8o",
      releaseDate: "7/9/2023",
    },
    {
      title: "แฟนฉัน (Love Ads)",
      description: `“แต่อยากขอพูดอะไรเกินจริงหน่อยได้มั้ย…ให้โอกาสฉันโฆษณาแปปนึง” 
ถ้าจีบแบบอ้อมค้อมแล้วเธอไม่เก็ท ก็ขอยิงแอดใส่เธอเลยแล้วกัน

คู่หูดูโอ้ SERIOUS BACON กลับมาส่งเพลงน่ารัก ๆ อีกครั้งกับเพลง แฟนฉัน (Love Ads) เพลงของคนคลั่งรักที่อยากได้เธอเป็นแฟน ในเพลงนี้จะได้เห็นภาพลักษณ์ของเค้กและเมือง ที่สดใสมากขึ้น และ กวนโอ๊ยมากขึ้นด้วยเช่นกัน พร้อมกับท่าเต้นน่ารัก ๆ ที่ SERIOUS BACON ได้เต้นแบบจริงจังครั้งแรก
รับรองว่าทุกคนเต้นตามกันได้อย่างแน่นอน`,
      image: img15,
      linkYoutube: "https://www.youtube.com/watch?v=dhz_W_tCdHA",
      releaseDate: "28/3/2024",
    },
    {
      title: "I (don't) MISS YOU (Japanese Version)",
      description: `This is our very first Japanese Song! 🇯🇵
'I (don't) MISS YOU' is the first single of our latest EP Album called 'Dinner In Tokyo' which we've been soooooo excited about. Hope you guys like it. 💖🥓 

และนี่คือเพลงญี่ปุ่นเพลงแรกของพวกเราาาา ตื่นเต้นและสนุกที่ได้ทำเพลงใน EP Album นี้มาก ๆ ฮะ ฝากเพลงนี้ และเพลงอื่น ๆ ในอัลบั้ม Dinner In Tokyo ของพวกเราด้วยฮะ เป็นครั้งแรกที่ได้ทำงานกับโปรดิวเซอร์คนญี่ปุ่น ขอบคุณคุณ TSINGTAO ที่ช่วยพวกเรารังสรรค์เพลงนี้ออกมา หวังว่าทุกคนจะชอบนะ ❤️`,
      image: img16,
      linkYoutube: "https://www.youtube.com/watch?v=9pqyJ5n33sA",
      releaseDate: "6/5/2024",
    },
    {
      title: "โกหกเธอทั้งนั้น (Pinocchio)",
      description: `"“เธอยังเชื่อใจคนขี้โกหกอย่างฉัน
ก็กลัวถ้าพูดมันไป จะไม่มีเธออีก”

หลังจากปล่อยเพลงน่ารักๆสุดไวรัล กับเพลง แฟนฉัน (Love Ads)  เค้กและเมือง จาก Serious bacon ได้ปล่อยเพลงช้า เนื้อหาเศร้า เอาใจคนแอบรักเพื่อน
โกหกเธอทั้งนั้น พูดถึงความสัมพันธ์ของเพื่อน ที่คิดเกินเพื่อน ต้องปิดบัง โกหก ความรู้สึกของตัวเองเอาไว้ เพราะกลัวว่า คำว่ารัก จะทำให้ไม่มีคำว่าเราอีกต่อไปอีกหนึ่งความพิเศษคือ เค้ก ที่รับบทบาทแสดงนำใน MV และต้องถ่ายทอดความรู้สึกแอบรักครั้งนี้ จะเป็นอย่างไรต้องติดตามในเพลง โกหกเธอทั้งนั้น - Serious Bacon
“เค้กเขียนเพลงนี้ขึ้นมาจากหนังเรื่องหนึ่ง ในหนังเล่าเรื่องคนสองคนที่รู้สึกดีต่อกันแต่เลือกที่จะเก็บไว้จนถึงที่สุด ยังไงก็ไม่ยอมบอกเพราะกลัวจะเสียคนสำคัญคนนี้ไป ฟังดูเป็นเรื่องธรรมดาของการแอบรักแหละเนอะ แต่เรามองว่า บางครั้งการเลือกที่จะแกล้งทำเป็นว่าไม่รู้สึกอะไร ไม่ได้รัก ทั้ง ๆ ที่ในใจไม่ใช่อย่างนั้น ในมุมนึงมันจะเหมือนเราโกหกเขาอยู่ไหมนะ หรือไม่ก็อาจจะโกหกตัวเองอยู่ก็ได้ เลยเขียนเพลงนี้ขึ้นมาฮะ

ในพาร์ทดนตรีของเมือง เพลงนี้เป็นเพลงที่มีพี่ ๆ นักดนตรีมาช่วยอัดเยอะที่สุดแล้วครับ ตั้งใจกับทุกรายละเอียดที่ใส่ลงไปในเพลงมาก ๆ อาจจะไม่ได้มีเครื่องดนตรีเยอะ แต่อยากให้ทุกคนลองตั้งใจฟังกันดู เป็นอีกหนึ่งเพลงที่ภูมิใจและมีความสุขกับมันมาก ๆ ครับ ฝากเพลงนี้ของพวกเราด้วยน้าาา ❤️”"`,
      image: img17,
      linkYoutube: "https://www.youtube.com/watch?v=P1HhTYwrR5A",
      releaseDate: "25/7/2024",
    },
    {
      title: "อย่าไปรักเขาเลยเธอ (Someone Who Cares)",
      description: `อย่าไปรักเขาเลยเธอ...ทั้งหมดใจที่มีอย่าให้เขาเลยเธอ
เขาไม่คู่ควร...

Single ส่งท้ายปีของ SERIOUS BACONครั้งนี้กลับมากับเพลงสไตล์ Synth Pop กับเนื้อหาตรงใจสถานะพระรอง ที่เห็นคนที่รักเสียใจเพราะ “เขา” จนอยากบอกเธอว่า “อย่าไปรักเขาเลยเธอ”

เพลงสไตล์ Synth Pop ทำให้นึกถึงบรรยากาศของเมืองยามค่ำคืน Serious Bacon จึงพากันไปถ่ายทำ MV ถึง ประเทศฮ่องกง และ เมือง SERIOUS BACON ได้แสดงนำใน MV เพลงนี้ด้วย ถึงแม้จะเป็นเพลงเศร้า แต่ MV ก็ยังมีความน่ารักผสมผสานอยู่ ในเพลง อย่าไปรักเขาเลยเธอ`,
      image: img18,
      linkYoutube: "https://www.youtube.com/watch?v=CR_jK8HndDo",
      releaseDate: "14/11/2024",
    },
    {
      title: "เธอ ๆ เพื่อนเราชอบ (Guess Who?)",
      description: `เธอ ๆ เพื่อนฉันชอบเธออะ...
เออ ใช่ ฉันเองคือเพื่อนคนนั้นแหละ !

SERIOUS BACON ศิลปินดูโอ้จาก Boxx Music เสิร์ฟเพลงแรกของปี 2025
กับเพลงสดใส ติดกวน ติดเล่น ติดตลก แต่ก็ติดใจเธอด้วย (ฮิ้ว) “เธอ ๆ เพื่อนเราชอบ” เป็นเพลงของคนอยากสารภาพรัก แต่ดันติดเล่น ก็ไม่รู้ว่าเธอจะชอบมั้ย ถ้าเราเป็นคนไม่ค่อยตะหลุก เอ้ย คนไม่ค่อยตลก เอ้ย เฮ้ย ถูกแล้ว

ใครแอบชอบเพื่อน แต่ไม่กล้าบอกตรง ๆ ลองส่งเพลงนี้ให้เค้าดู อาจจะไม่โรแมนติกแต่ก็มีแอบยิ้มนะ`,
      image: img19,
      linkYoutube: "https://www.youtube.com/watch?v=wGFRGiG_TKM",
      releaseDate: "18/2/2025",
    },
  ];

  return (
    <>
      {/* <Navbar /> */}
      <div className="min-h-screen bg-yellow-100 flex flex-col items-center py-10">
        <h1 className="text-4xl font-bold text-amber-900 mb-3 animate__animated animate__backInDown">
          Music List 🎵
        </h1>
        <Link to="/">
          <h1 className="bg-amber-200 text-black py-2 px-6 rounded-lg hover:bg-amber-400 transition duration-300 animate__animated animate__backInDown mb-3">Back</h1>
        </Link>

        <div className="w-full px-4">
          {/* ใช้ grid layout กับ 3 คอลัมน์ */}
          <div className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-8">
            {musicList
              .slice() // สร้างสำเนาเพื่อไม่แก้ไขต้นฉบับ
              .sort((a, b) => {
                const dateA = new Date(
                  a.releaseDate.split("/").reverse().join("-")
                );
                const dateB = new Date(
                  b.releaseDate.split("/").reverse().join("-")
                );
                return dateB - dateA; // เรียงจากใหม่ไปเก่า
              })
              .map((musicList, index) => {
                // กำหนดสีพื้นหลังของ hover โดยใช้ Earth Tone
                const earthToneHoverColors = [
                  "hover:bg-amber-300",
                  "hover:bg-yellow-400",
                  "hover:bg-orange-300",
                  "hover:bg-lime-300",
                  "hover:bg-teal-200",
                  "hover:bg-gray-300",
                  "hover:bg-brown-300",
                  "hover:bg-green-200",
                  "hover:bg-olive-200",
                  "hover:bg-cyan-300",
                ];

                // เลือกสีจาก array ตาม index
                const hoverColor =
                  earthToneHoverColors[index % earthToneHoverColors.length];

                return (
                  <div
                    key={index}
                    className={`bg-yellow-200 shadow-xl rounded-3xl p-5 mb-8 border-l-4 border-amber-600
                animate__animated animate__fadeInUp ${hoverColor} hover:shadow-2xl hover:scale-105 transition-all duration-300 transform`}
                  >
                    {/* ลิงก์ไปที่ YouTube */}
                    <a
                      href={musicList.linkYoutube}
                      target="_blank"
                      rel="noopener noreferrer"
                    >
                      <img
                        src={musicList.image}
                        alt={musicList.title}
                        className="w-full h-auto object-cover rounded-lg mb-6 transition-all duration-300 transform hover:scale-105 hover:shadow-xl"
                      />
                    </a>

                    <h2 className="text-2xl font-semibold text-amber-800 mb-4 text-center hover:text-amber-600 tracking-wide">
                      {musicList.title}
                    </h2>
                    <p className="text-brown-700 text-center mb-4 leading-relaxed font-medium">
                      {musicList.description}
                    </p>

                    {musicList.releaseDate && (
                      <p className="text-brown-700 mt-2 text-center italic text-sm">
                        วันที่เผยแพร่: {musicList.releaseDate}
                      </p>
                    )}
                  </div>
                );
              })}
          </div>
        </div>
      </div>
    </>
  );
}
